InformationRegisters/НастройкиПроекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>НастройкиПроекта</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Значение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
						<v8:Type>xs:string</v8:Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:TypeSet>cfg:AnyIBRef</v8:TypeSet>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>3</v8:FractionDigits>
						</v8:NumberQualifiers>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяНастройки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>НомерНастройки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Теги.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Теги</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Текст</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>30</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветТекста</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЦветФона</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/омТегиПовтор/Ext/Module.bsl
Функция ПолучитьТаблицуТегов(мТеги = Неопределено) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	Теги.Ссылка КАК Ссылка,
		|	Теги.Текст КАК Текст,
		|	Теги.ЦветТекста КАК ЦветТекста,
		|	Теги.ЦветФона КАК ЦветФона
		|ИЗ
		|	Справочник.Теги КАК Теги
		|ГДЕ
		|	НЕ Теги.ПометкаУдаления
		|	И ВЫБОР
		|			КОГДА &ИспользоватьТеги
		|				ТОГДА ИСТИНА
		|			ИНАЧЕ Теги.Ссылка В (&мТеги)
		|		КОНЕЦ";
	
	Запрос.УстановитьПараметр("ИспользоватьТеги", ?(мТеги = Неопределено, Ложь, Истина));
	Запрос.УстановитьПараметр("мТеги", мТеги);
	
	Возврат Запрос.Выполнить().Выгрузить();
	
КонецФункции // ПолучитьТаблицуТегов()

Функция ПолучитьТегКомментарий() Экспорт

	ОбъектОтчета = Отчеты.ОбщиеНастройки.Создать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкиПроекта.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки = &ИмяНастройки";
	
	Запрос.УстановитьПараметр("ИмяНастройки", ОбъектОтчета.НаименованиеКолонкиДляТегаКомментарий());
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл

		Возврат Выборка.Значение;
		
	КонецЦикла;
	
	Возврат Справочники.Теги.ПустаяСсылка();

КонецФункции // ПолучитьТегКомментарий()

Функция ПолучитьДанныеТегаКомментарий()

	стВозврата = Новый Структура("Текст, ЦветТекста, ЦветФона", );
	
	ОбъектОтчета = Отчеты.ОбщиеНастройки.Создать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ ПЕРВЫЕ 1
		|	НастройкиПроекта.Значение КАК Значение
		|ПОМЕСТИТЬ вт
		|ИЗ
		|	РегистрСведений.НастройкиПроекта КАК НастройкиПроекта
		|ГДЕ
		|	НастройкиПроекта.ИмяНастройки = &ИмяНастройки
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	Теги.Текст КАК Текст,
		|	Теги.ЦветТекста КАК ЦветТекста,
		|	Теги.ЦветФона КАК ЦветФона
		|ИЗ
		|	вт КАК вт
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Теги КАК Теги
		|		ПО вт.Значение = Теги.Ссылка";
	
	Запрос.УстановитьПараметр("ИмяНастройки", ОбъектОтчета.НаименованиеКолонкиДляТегаКомментарий());
	
	Выборка = Запрос.Выполнить().Выбрать(); 
	
	Если Выборка.Количество() = 0 Тогда
	
		стВозврата.Текст 		= "";
		стВозврата.ЦветТекста 	= Новый Цвет(0, 0, 0);
		стВозврата.ЦветФона 	= Новый Цвет(200, 255, 200);
	
	Иначе
		
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(стВозврата, Выборка);
	
	КонецЕсли;
	
	Возврат стВозврата;
	
КонецФункции // ПолучитьДанныеТегаКомментарий()
